### Pandas - DataFrame
- 2차원 행렬(표), Series를 묶어낸 자료형

In [1]:
import numpy as np
import pandas as pd

##### DataFrame 생성

In [2]:
# dictionary-list 활용
data = {
    'one': [1, 2, 3, 4, 5],
    'two': ['가', '나', '다', '라', '마'],
    'three': [1.23, 2.34, 3.45, 4.56, 5.67],
    'four': True
}

df = pd.DataFrame(data)
df

   one two  three  four
0    1   가   1.23  True
1    2   나   2.34  True
2    3   다   3.45  True
3    4   라   4.56  True
4    5   마   5.67  True

In [10]:
# list-dictionary 활용
data = [
    {'a': 1, 'b': 2, 'c': 3},
    {'a': 4, 'b': 5},
    {'a': 7, 'b': 8, 'c': 9},
]

df = pd.DataFrame(data)

df.index = ['다람쥐', '고릴라', '원숭이']
print(df.index)     # index는 열을 나타냄

df.columns = ['협동심', '성실도', '인내심']
print(df.columns)   # columns는 행을 나타냄

df

Index(['다람쥐', '고릴라', '원숭이'], dtype='object')
Index(['협동심', '성실도', '인내심'], dtype='object')

     협동심  성실도  인내심
다람쥐    1    2  3.0
고릴라    4    5  NaN
원숭이    7    8  9.0

In [15]:
# 2차원 ndarray 활용
arr = np.random.randn(2, 3)
df = pd.DataFrame(arr, index = ['ㄱ', 'ㄴ'], columns = ['A', 'B', 'C'])

# df.index = ['ㄱ', 'ㄴ']
# df.columns = ['A', 'B', 'C']
df

          A         B         C
ㄱ  1.273087  0.772659  0.467750
ㄴ -0.865444 -0.305166  0.390171

In [21]:
data = {
    '이름': ["다람쥐", "판다", '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['M', 'F', 'F']
}
df = pd.DataFrame(data)
# df = pd.DataFrame(data, index=['Squirrel', 'Panda', 'Koala'])
print(df)

    이름  위치 성별
0  다람쥐  독산  M
1   판다  종로  F
2  코알라  하남  F

In [22]:
# 전치행렬 (행과 열을 바꿈)
print(df.T)

      0   1    2
이름  다람쥐  판다  코알라
위치   독산  종로   하남
성별    M   F    F

---

##### DataFrame 속성

In [25]:
print(df.index)
print(df.columns)
print(df.values, type(df.values))

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '위치', '성별'], dtype='object')
[['다람쥐' '독산' 'M']
 ['판다' '종로' 'F']
 ['코알라' '하남' 'F']] <class 'numpy.ndarray'>

In [26]:
print(df.shape)     # 형태
print(df.size)      # 요소 개수
print(df.ndim)      # 깊이
print(df.dtypes)    # 요소의 자료형

(3, 3)
9
2
이름    object
위치    object
성별    object
dtype: object

---

##### DataFrame 메서드

In [27]:
bank_client_df = pd.DataFrame({
    'Client ID': [1, 2, 3, 4],
    'Client Name': ['Aly', 'Steve', 'Nicole', 'Morris'],
    "Net worth [$]": [35000, 3000, 100000, 2000],
    'Years with bank': [4, 7, 10, 15]  
})
bank_client_df

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [28]:
print(bank_client_df.head(2))
print(bank_client_df.tail(2))

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [29]:
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Client ID        4 non-null      int64
 1   Client Name      4 non-null      object
 2   Net worth [$]    4 non-null      int64
 3   Years with bank  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [31]:
bank_client_df.describe()

       Client ID  Net worth [$]  Years with bank
count   4.000000       4.000000         4.000000
mean    2.500000   35000.000000         9.000000
std     1.290994   45963.753836         4.690416
min     1.000000    2000.000000         4.000000
25%     1.750000    2750.000000         6.250000
50%     2.500000   19000.000000         8.500000
75%     3.250000   51250.000000        11.250000
max     4.000000  100000.000000        15.000000

In [40]:
# indexing/slicing
# iloc 인덱스 - 행/열 순서로 조회
# loc 라벨 - 행/열 순서로 조회

print(bank_client_df.iloc[0])
print(type(bank_client_df.iloc[0]))
print(bank_client_df.iloc[0].index)
print(bank_client_df.iloc[0].name)

Client ID              1
Client Name          Aly
Net worth [$]      35000
Years with bank        4
Name: 0, dtype: object
<class 'pandas.core.series.Series'>
Index(['Client ID', 'Client Name', 'Net worth [$]', 'Years with bank'], dtype='object')
0

In [43]:
bank_client_df.iloc[:2], type(bank_client_df.iloc[:2])

(   Client ID Client Name  Net worth [$]  Years with bank
 0          1         Aly          35000                4
 1          2       Steve           3000                7,
 pandas.core.frame.DataFrame)

In [45]:
bank_client_df.iloc[[0, 2]], type(bank_client_df.iloc[[0, 2]])

(   Client ID Client Name  Net worth [$]  Years with bank
 0          1         Aly          35000                4
 2          3      Nicole         100000               10,
 pandas.core.frame.DataFrame)

In [49]:
# fance indexing을 통한 조회는 결과가 1개여도 DataFrame 타입으로 반환
# -> Series를 반환한다는 것은 차원을 축소(제거)하는 것이고
# -> DataFrame을 반환한다는 것은 차원을 유지하는 것
print(bank_client_df.iloc[[2]].shape)
print(bank_client_df.iloc[2].shape)

bank_client_df.iloc[[2]], type(bank_client_df.iloc[[2]])

(1, 4)
(4,)

(   Client ID Client Name  Net worth [$]  Years with bank
 2          3      Nicole         100000               10,
 pandas.core.frame.DataFrame)

In [50]:
# 2차원 indexing/slicing
bank_client_df.iloc[0, 1]

'Aly'

In [52]:
bank_client_df.iloc[:2, 1], type(bank_client_df.iloc[:2, 1])

(0      Aly
 1    Steve
 Name: Client Name, dtype: object,
 pandas.core.series.Series)

In [53]:
bank_client_df.iloc[:2, 2:], type(bank_client_df.iloc[:2, 2:])

(   Net worth [$]  Years with bank
 0          35000                4
 1           3000                7,
 pandas.core.frame.DataFrame)

In [55]:
bank_client_df.index = ['client1', 'client2', 'client3', 'client4']

In [56]:
bank_client_df.loc['client3']

Client ID               3
Client Name        Nicole
Net worth [$]      100000
Years with bank        10
Name: client3, dtype: object

In [57]:
# Slicing
bank_client_df.loc['client2':'client4':2]

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
client4          4      Morris           2000               15

In [59]:
bank_client_df.loc['client2':'client4':2, 'Client Name']

client2     Steve
client4    Morris
Name: Client Name, dtype: object

In [63]:
bank_client_df.loc['client2':'client4':2, 'Client Name':'Net worth [$]']

        Client Name  Net worth [$]
client2       Steve           3000
client4      Morris           2000

In [61]:
bank_client_df.loc['client2':'client4':2, ['Client Name', 'Years with bank']]

        Client Name  Years with bank
client2       Steve                7
client4      Morris               15

In [76]:
# 이름이 Steve인 고객 정보 출력
# print(bank_client_df.loc['client2'])
print(bank_client_df.loc[bank_client_df['Client Name'] == 'Steve'])

Client ID              2
Client Name        Steve
Net worth [$]       3000
Years with bank        7
Name: client2, dtype: object
         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
        Client Name
client1         Aly
client2       Steve
client3      Nicole
client4      Morris
        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [77]:
# Client Name 만 출력
print(bank_client_df.loc[:, ['Client Name']])

        Client Name
client1         Aly
client2       Steve
client3      Nicole
client4      Morris

In [82]:
# Client Name과 Net worth [$] 출력
print(bank_client_df[['Client Name','Net worth [$]']])

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [83]:
# filter -> items를 주어 값을 가져온다.
bank_client_df.filter(items=['Client Name', 'Net worth [$]'])

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [84]:
bank_client_df.filter(like='$', axis=1)

         Net worth [$]
client1          35000
client2           3000
client3         100000
client4           2000

In [87]:
bank_client_df.filter(like='4', axis=0)

         Client ID Client Name  Net worth [$]  Years with bank
client4          4      Morris           2000               15

In [ ]:
# 문제 주석

---

### 행 추가 및 삭제

In [110]:
student = [
    {'name': '호랑이', 'midterm': 95, 'final': 85},
    {'name': '늑대', 'midterm': 93, 'final': 90},
    {'name': '양', 'midterm': 100, 'final': 10},
]
df = pd.DataFrame(student)
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10

In [111]:
# 행 추가
# 1. loc 이용
df.loc[len(df)] = ['부엉이', 88, 72]
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3  부엉이       88     72

In [112]:
# 2. pd.concat() 이용 : DataFrame 병합
add_student_df = pd.DataFrame([['곰', 99, 24]], columns=['name', 'midterm', 'final'])
pd.concat([df, add_student_df], ignore_index=True)

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3  부엉이       88     72
4    곰       99     24

In [109]:
# 행 삭제
# index 이용
df.drop(df.index[[0]], inplace=True)
df

Empty DataFrame
Columns: [name, midterm, final]
Index: []

---

### 컬럼 추가

In [127]:
df = pd.DataFrame({
    '이름': ["다람쥐", "판다", '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['M', 'F', 'F'],
    '키': [179, 165, 157],
    '체중': [50.1, 48.3, 50.7]
})

In [124]:
# 컬럼명 이용
df['취미'] = '인공지능 공부'
df

    이름  위치 성별    키    체중       취미
0  다람쥐  독산  M  179  50.1  인공지능 공부
1   판다  종로  F  165  48.3  인공지능 공부
2  코알라  하남  F  157  50.7  인공지능 공부

In [116]:
df['성별(한글)'] = np.where(df['성별'] == 'M', '남성', '여성')
df

    이름  위치 성별       취미 성별(한글)
0  다람쥐  독산  M  인공지능 공부     남성
1   판다  종로  F  인공지능 공부     여성
2  코알라  하남  F  인공지능 공부     여성

In [128]:
# 기존 컬럼 연산
df['BMI'] = df['체중'] / ((df['키'] * 0.01) ** 2) # BMI = kg / m^2
df

    이름  위치 성별    키    체중        BMI
0  다람쥐  독산  M  179  50.1  15.636216
1   판다  종로  F  165  48.3  17.741047
2  코알라  하남  F  157  50.7  20.568786

In [129]:
# apply
def get_type(value):
    return '저체중' if value < 18 else '표준'

df['BMI type'] = df['BMI'].apply(get_type)
df

    이름  위치 성별    키    체중        BMI BMI type
0  다람쥐  독산  M  179  50.1  15.636216      저체중
1   판다  종로  F  165  48.3  17.741047      저체중
2  코알라  하남  F  157  50.7  20.568786       표준

In [167]:
df.drop('BMI type', axis=1, inplace=True)
df

KeyError: "['BMI type'] not found in axis"

In [134]:
df = pd.read_csv("data/bank_client_information.csv")
df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [135]:
df.sort_values("Net Worth", ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [136]:
# 오래된 고객 순으로
df.sort_values("Years with Bank", ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [144]:
# 순자산이 많고 오래된 고객순으로 출력
df.sort_values(['Net Worth', "Years with Bank"], ascending=[False, False])

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [148]:
# rank()
df['Rank'] = df['Net Worth'].rank(ascending=False).astype(int)
df.sort_values('Rank')

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Rank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,1
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,2
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,4
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,5
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,6
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,7
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,8
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,8
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,10

In [176]:
# pandas

# 1
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York', 'Salary': 70000},
    {'Name': 'Bob', 'Age': 30, 'City': 'Los Angeles', 'Salary': 80000},
    {'Name': 'Charlie', 'Age': 35, 'City': 'Chicago', 'Salary': 120000},
    {'Name': 'David', 'Age': 40, 'City': 'Houston', 'Salary': 90000},
    {'Name': 'Eve', 'Age': 28, 'City': 'San Francisco', 'Salary': 75000}
]

# 1
df = pd.DataFrame(data)
df

      Name  Age           City  Salary
0    Alice   25       New York   70000
1      Bob   30    Los Angeles   80000
2  Charlie   35        Chicago  120000
3    David   40        Houston   90000
4      Eve   28  San Francisco   75000

In [177]:
# 2
print(df.loc[:, ['Name', 'City']])

      Name           City
0    Alice       New York
1      Bob    Los Angeles
2  Charlie        Chicago
3    David        Houston
4      Eve  San Francisco

In [178]:
# 3
df['Country'] = 'USA'

df.loc[len(df)] = ['Frank', 33, 'Seattle', 85000, 'USA']
print(df)

      Name  Age           City  Salary Country
0    Alice   25       New York   70000     USA
1      Bob   30    Los Angeles   80000     USA
2  Charlie   35        Chicago  120000     USA
3    David   40        Houston   90000     USA
4      Eve   28  San Francisco   75000     USA
5    Frank   33        Seattle   85000     USA

In [186]:
# 4

df.drop('Salary', axis=1, inplace=True)
df.drop(df.index[[3]], inplace=True)

print(df)

      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30    Los Angeles     USA
2  Charlie   35        Chicago     USA
4      Eve   28  San Francisco     USA
5    Frank   33        Seattle     USA

In [ ]:
# 5

df[]